import os
from flask import Flask

app = Flask(__name__)

@app.route("/")
def home():
    return """<h1> نام و نام خانوادگی : محمدامین سعیدی <h1>
    
<h2>برنامه‌نویس نرم‌افزار | Python و C#<h2> 
<br>
<img src="/static/profile.jpg" alt="عکس من" width="450" height="500">
<br>

<h1>درباره من <h1>
<h3>محمد امین سعیدی، برنامه‌نویس علاقه‌مند به توسعه نرم‌افزار و فناوری اطلاعات، با تمرکز بر زبان‌های برنامه‌نویسی Python و C# است. در حال حاضر دانش‌آموز پایه نهم بوده و به‌صورت مستمر در زمینه برنامه‌نویسی و توسعه مهارت‌های فنی فعالیت می‌کند.<h3> 

<h3>تاکنون چندین پروژه نرم‌افزاری و دو تا سه وب‌سایت توسعه داده است. از جمله فعالیت‌های انجام‌شده می‌توان به طراحی و پیاده‌سازی یک چت‌بات و توسعه پروژه‌های مختلف نرم‌افزاری اشاره کرد.<h3>

<h3>تمرکز اصلی وی بر یادگیری مستمر، حل مسائل برنامه‌نویسی، ارتقای مهارت‌های فنی و توسعه نرم‌افزارهای کاربردی است.<h3> 
<br>
<br>
<H1>مهارت‌های فنی <H1>

<h3>Python: برنامه‌نویسی و توسعه پروژه‌های نرم‌افزاری <h3>
<h3>C#: برنامه‌نویسی و پیاده‌سازی برنامه‌های کاربردی <h3>
<h3> توسعه وب: تجربه طراحی و پیاده‌سازی وب‌سایت <h3>
<h3> توسعه چت‌بات: تجربه ساخت برنامه‌های تعاملی <h3>
<h3> حل مسئله: تمرین و به‌کارگیری مفاهیم برنامه‌نویسی <h3>
<br>

<h1>پروژه‌ها و فعالیت‌ها <h1>

<h3>چت‌ بات <h3>

<P>طراحی و پیاده‌سازی یک چت‌بات با هدف ایجاد تعامل با کاربران و کسب تجربه در توسعه برنامه‌های تعاملی.<P> 

<p>پروژه‌های نرم‌افزاری <P>

<P>طراحی و پیاده‌سازی چندین پروژه برنامه‌نویسی با هدف تمرین مفاهیم فنی و توسعه مهارت‌های نرم‌افزاری.<P> 

طراحی و توسعه وب‌سایت 

<P>پیاده‌سازی چند وب‌سایت با هدف کسب تجربه عملی در زمینه توسعه وب و طراحی صفحات اینترنتی.<P> 

<br>
<h1>تحصیلات <h1>

<h3>دانش‌آموز پایه نهم <h3>

<br>

<h1>اهداف حرفه‌ای <h1>

<h3>توسعه دانش برنامه‌نویسی، یادگیری فناوری‌های نوین، ارتقای کیفیت پروژه‌های نرم‌افزاری و گسترش تجربه در حوزه توسعه وب و هوش مصنوعی از اهداف اصلی من است. <h3>
<br>

<img src="/static/amin.jpg" alt="عکس من" width="600">

<h1>اطلاعات تماس و نمونه‌کارها <h1>

<h3> [madmaminsaeidi1391@gmail.com] : ایمیل <h3> 
<h3> شماره تماس : [4391 244 0939] <h3>
<br>
<h1>[با تشکر از همراهی شما]<h1>"""

    

if __name__ == '__main__':
    port = int(os.environ.get('PORT', 5000))
    app.run(host='0.0.0.0', port=port)
    